soap/searchRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <context xmlns="urn:zimbraMail">
            <nonotify />
            <noqualify />
            <authToken>AUTH_TOKEN_PLACEHOLDER</authToken>
        </context>
    </soap:Header>
    <soap:Body>
        <SearchRequest xmlns="urn:zimbraMail">
            <query>QUERY_PLACEHOLDER</query>
        </SearchRequest>
    </soap:Body>
</soap:Envelope>
